query = """
--
"""
df = pd.read_sql(query, engine)
print(df)

In [14]:
from sqlalchemy import create_engine

In [15]:
db_url = 'postgresql+psycopg2://Test:bQNxVzJL4g6u@ep-noisy-flower-846766.us-east-2.aws.neon.tech/TravelTide'

In [16]:
engine = create_engine(db_url)

In [17]:
connection = engine.connect()

In [18]:
import pandas as pd

In [21]:
query = """
--Query the users table to get a breakdown of users by gender, marital status, and whether they have children.

SELECT
    gender,
    married,
    has_children,
    COUNT(user_id) AS total_users
FROM
    users
GROUP BY
    gender,
    married,
    has_children
ORDER BY
    gender,
    married,
    has_children;
    """
df = pd.read_sql(query, engine)
print(df)

   gender  married  has_children  total_users
0       F    False         False       200053
1       F    False          True        70928
2       F     True         False       110504
3       F     True          True        72169
4       M    False         False       257074
5       M    False          True        91457
6       M     True         False       127701
7       M     True          True        82754
8       O    False         False         4938
9       O    False          True         1659
10      O     True         False         1019
11      O     True          True          670

In [22]:
query = """
--What is the distribution of the user's birth year? Do you spot any irregularity there? What is special about birth year 2006? How would you calculate the age based on birth date?
-- Query 1: Get distribution of users' birth years
SELECT
    EXTRACT(YEAR FROM birthdate) AS birth_year,
    COUNT(user_id) AS total_users
FROM
    users
GROUP BY
    birth_year
ORDER BY
    birth_year;

-- Query 2: Check details for users born in 2006
SELECT
    birthdate,
    COUNT(user_id) AS total_users
FROM
    users
WHERE
    EXTRACT(YEAR FROM birthdate) = 2006
GROUP BY
    birthdate
ORDER BY
    birthdate;

-- Query 3: Calculate current age of users
SELECT
    user_id,
    birthdate,
    DATE_PART('year', AGE(birthdate)) AS age
FROM
    users;
"""
df = pd.read_sql(query, engine)
print(df)

         user_id   birthdate   age
0         709748  1985-02-03  39.0
1         709749  1994-06-14  30.0
2         709750  1966-01-08  58.0
3         709751  1985-01-20  39.0
4         709752  1992-09-08  31.0
...          ...         ...   ...
1020921   709743  1973-04-14  51.0
1020922   709744  1991-11-04  32.0
1020923   709745  1984-07-11  39.0
1020924   709746  1984-08-03  39.0
1020925   709747  1972-03-04  52.0

[1020926 rows x 3 columns]

In [23]:
query = """
-- Calculate the average customer age in months
SELECT
    AVG(DATE_PART('year', AGE(sign_up_date)) * 12 + DATE_PART('month', AGE(sign_up_date))) AS average_customer_age_months
FROM
    users;

"""
df = pd.read_sql(query, engine)
print(df)

   average_customer_age_months
0                    18.964403

In [30]:
query = """
-- What are the 10 most popular hotels?
SELECT
    hotel_name,
    COUNT(trip_id) AS total_bookings,
    AVG(nights) AS average_duration_stay,
    AVG(hotel_per_room_usd) AS average_price_per_room_before_discount
FROM
    hotels
GROUP BY
    hotel_name
ORDER BY
    total_bookings DESC
LIMIT 10;

"""
df = pd.read_sql(query, engine)
print(df)

                     hotel_name  total_bookings  average_duration_stay  \
0     Extended Stay  - new york           14075               4.057407
1          Radisson  - new york           14073               4.158815
2          Starwood  - new york           14029               4.131941
3            Conrad  - new york           14022               4.113607
4           Rosewood - new york           14017               4.152386
5       Banyan Tree  - new york           13974               4.110562
6       Best Western - new york           13959               4.145498
7         Shangri-La - new york           13958               4.104814
8  InterContinental  - new york           13956               4.132774
9              Hyatt - new york           13940               4.111908

   average_price_per_room_before_discount
0                              178.542877
1                              178.258154
2                              176.555706
3                              176.305805
4                              178.297353
5                              176.292185
6                              178.606562
7                              175.588695
8                              174.367154
9                              176.841535

In [31]:
query = """
--What is the most used airline in the last 6 months of recorded data?
WITH latest_date AS (
    SELECT MAX(departure_time) AS max_date
    FROM flights
),
last_six_months AS (
    SELECT
        trip_airline,
        COUNT(*) AS flight_count
    FROM
        flights, latest_date
    WHERE
        departure_time BETWEEN max_date - INTERVAL '6 months' AND max_date
    GROUP BY
        trip_airline
)
SELECT
    trip_airline AS airline,
    flight_count
FROM
    last_six_months
ORDER BY
    flight_count DESC
LIMIT 1;
"""
df = pd.read_sql(query, engine)
print(df)

             airline  flight_count
0  American Airlines          2591

In [32]:
query = """
--  What is the average number of seats booked per flight?
SELECT
    AVG(seats) AS average_seats_booked
FROM
    flights;
"""
df = pd.read_sql(query, engine)
print(df)

   average_seats_booked
0              1.250864

In [33]:
query = """
--What is the variability of the price for the same flight routes over different seasons?
WITH route_season_prices AS (
    SELECT
        origin_airport,
        destination_airport,
        EXTRACT('month' FROM departure_time) AS month,
        AVG(base_fare_usd) AS average_price,
        STDDEV_POP(base_fare_usd) AS std_dev_price
    FROM
        flights
    WHERE
        departure_time >= '2023-01-01' AND departure_time < '2024-01-01' -- Example: Analyzing prices for year 2023
    GROUP BY
        origin_airport, destination_airport, month
)
SELECT
    origin_airport,
    destination_airport,
    TO_CHAR(TO_TIMESTAMP(month::text, 'MM'), 'Month') AS month_name,
    average_price,
    std_dev_price
FROM
    route_season_prices
ORDER BY
    origin_airport, destination_airport, month;
"""
df = pd.read_sql(query, engine)
print(df)

       origin_airport destination_airport month_name  average_price  \
0                 AKR                 AEP  July         4863.205000
1                 AKR                 AGR  March        2209.450000
2                 AKR                 AGR  October      4748.270000
3                 AKR                 AGR  December     4144.750000
4                 AKR                 AKL  February     2375.540000
...               ...                 ...        ...            ...
152808            YZD                 YYC  May           545.083784
152809            YZD                 YYC  June          554.947778
152810            YZD                 YYC  July          559.163256
152811            YZD                 YYC  August        701.665000
152812            YZD                 YYC  December      493.010000

        std_dev_price
0         1231.645000
1            0.000000
2            0.000000
3          134.820000
4            0.000000
...               ...
152808     251.711557
152809     224.328347
152810     241.814530
152811     230.565000
152812       0.000000

[152813 rows x 5 columns]